import numpy as np
import matplotlib.pyplot as plt

# Временные промежутки ступеней(сек): 0 - 73, 73 - 216, 216 - 228

#Временные промежутки ступеней:
TIME_1 = 73 # Время, после которого первый этап отделяется, сек
TIME_2 = 216 - 73 # Время, после которого второй этап отделяется, сек
TIME_3 = 228 - 216 # Время, после которого третий этап отделяется, сек


#Масса ракеты в различных стадиях полета:
START_MASS_1 = 305000 # Начальная масса ракеты, кг

MASS_1_1 = 173300 # Первая ступень с топливом, кг
MASS_1_0 = 15000 # Первая ступень без топлива, кг

MASS_2_1 = 100000 # Вторая ступень с топливом, кг
MASS_2_0 = 6000 # Вторая ступень без топлива, кг

MASS_3_1 = 25450 # Третья ступень с топливом, кг
MASS_3_0 = 2710 # Третья ступень без топлива, кг

#Коэффициенты, которые определяют изменение массы ракеты со временем:
K_1 = (MASS_1_1 - MASS_1_0) / TIME_1 #Коэффициент изменения массы первой ступени ракеты со временем
K_2 = (MASS_2_1 - MASS_2_0) / TIME_2 #Коэффициент изменения массы второй ступени ракеты со временем
K_3 = (MASS_3_1 - MASS_3_0) / TIME_3 #Коэффициент изменения массы третьей ступени ракеты со временем

data_1 = np.arange(0, 228, 0.1) #Значения времени от 0 до 228 с шагом 0.1
data_2 = [] #Пустой список, который будет содержать значения массы ракеты со временем

#Моделяция изменение массы ракеты со временем
for i in data_1:  
    if i < 73:
        data_2.append(START_MASS_1 - K_1 * i)
    elif i < 216:
        data_2.append(START_MASS_1 - MASS_1_1 - K_2 * (i - 73))
    else:
        data_2.append(START_MASS_1 - MASS_1_1 - MASS_2_1 - K_3 * (i - 216))

#Реальные данные
data_real1 = np.arange(0, 246, 5)

data_real2 = np.array([305000, 293000, 282900, 272596, 262542, 252158, 242185, 231636,
            221417, 211115, 200731, 190347, 180292, 170100, 159524,
            102401, 99882, 96824, 94366, 92000, 89623, 87261, 85424,
            85361, 85336, 84000, 84000, 84000, 84000, 83791,
            83791, 83791, 83791, 83791, 83791, 83791, 83791, 83791,
            83791, 83791, 83791, 83791, 80116, 76061, 72196,
            68236, 64149, 55043, 43090, 32761])

#Построение графиков
x = np.linspace(0, 228)
fig, ax = plt.subplots()

ax.plot(data_1, data_2, label='Model')
ax.plot(data_real1, data_real2, label='Real')
ax.grid()

ax.set_xlabel('время (с)')
ax.set_ylabel('масса (кг)')

ax.legend()

plt.show()
